Конфигурация/src/InformationRegisters/ЦеныЗакупок/ЦеныЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныЗакупок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаЗакупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/CommonModules/РаботаСоСправочникамиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция УстановкаЗакупочнойЦены(АктуальнаяДата, Номенклатура) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ЗначениеРесурса = РегистрыСведений.ЦеныЗакупок.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениеРесурса.ЦенаЗакупки;
	
КонецФункции

Функция ОтпускнаяЦена(АктуальнаяДата, Номенклатура) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ЗначениеРесурса = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениеРесурса.Цена;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
 
#КонецОбласти
